app/controllers/tournament_organizers_controller.rb

	def index
		@tournament_organizers = TournamentOrganizer.all
---
SELECT "tournament_organizers".* FROM "tournament_organizers"

    def show
    	@tournament_organizer = TournamentOrganizer.find(params[:id])
---
SELECT  "tournament_organizers".* FROM "tournament_organizers" WHERE "tournament_organizers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]